In [56]:
import pandas as pd
import numpy as np

In [57]:
preco = 1000
def calcular_imposto(preco):
  return preco*0.3
print(calcular_imposto(preco))

300.0

In [58]:
calcular_imposto2 = lambda x: x*0.3
calcular_imposto2(preco)

300.0

In [59]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)), 
                        index=['a','c','d'], 
                        columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [60]:
f = lambda x: x.max() - x.min()
frame.apply(f)

Ohio          6
Texas         6
California    6
dtype: int32

In [61]:
frame.apply(f, axis='columns')

a    2
c    2
d    2
dtype: int32

In [62]:
frame['total'] = frame.apply(lambda x: x.sum(), axis='columns')
frame

   Ohio  Texas  California  total
a     0      1           2      3
c     3      4           5     12
d     6      7           8     21

In [63]:
frame['category'] = frame['total'].apply(lambda x: 'impar' if x%2 else 'par')
frame

   Ohio  Texas  California  total category
a     0      1           2      3    impar
c     3      4           5     12      par
d     6      7           8     21    impar

In [64]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

frame.apply(f)

     Ohio  Texas  California  total category
min     0      1           2      3    impar
max     6      7           8     21      par

In [65]:
numbers = pd.DataFrame(np.random.randn(4,3), columns=list('abc'), index=['c1', 'c2', 'c3', 'c4'])
numbers

           a         b         c
c1 -0.011458  1.027447  0.941156
c2 -1.771851  0.399366  0.242761
c3 -0.952968 -0.045092 -0.533831
c4 -0.420829  2.265779 -0.219021

In [66]:
format = lambda x: '%.2f' % x # %x (aplica no x)
numbers.applymap(format)

C:\Users\47131502023.1\AppData\Local\Temp\ipykernel_14164\2733044893.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  numbers.applymap(format)

        a      b      c
c1  -0.01   1.03   0.94
c2  -1.77   0.40   0.24
c3  -0.95  -0.05  -0.53
c4  -0.42   2.27  -0.22

In [67]:
def color_df(val):
  color = 'red' if val < 0 else 'blue'
  return 'color: ' + color

numbers.style.applymap(color_df)

C:\Users\47131502023.1\AppData\Local\Temp\ipykernel_14164\1754938728.py:5: FutureWarning: Styler.applymap has been deprecated. Use Styler.map instead.
  numbers.style.applymap(color_df)

In [68]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [69]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [70]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)), index=['three', 'one'], columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [71]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [72]:
frame.sort_index(axis='columns')

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [73]:
frame.sort_index(axis='columns', ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [74]:
obj = pd.Series([4,7,-3,2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [75]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [76]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [77]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [78]:
frame.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

## Atividade: Ajustando o Titanic


#### O QUE FAZER?
Criar um código com as seguintes operações:

    1. Carregar o dataset titanic em um dataframe;
    2. Copiar para um novo dataFrame somente as colunas Survived, Pclass, Age e Fare do dataset;
    3. Criar uma função lambda para alterar a formatação da coluna Survived para ter duas casas decimais;
    4. Criar uma função lambda para alterar a formatação da coluna Pclass para ter três casas decimais;
    5. Criar uma função lambda para alterar a formatação de todo o dataframe para usar somente uma casa
    decimal;
    6. Criar um dataframe com somente as 5 primeiras linhas do dataframe original;
    7. Ordenar o novo dataframe através da coluna Age;
    COMO FAZER?

In [79]:
url = 'https://web.stanford.edu/class/archive/cs/cs109/cs109.1166/stuff/titanic.csv'
titanic = pd.read_csv(url)
titanic

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500
...,...,...,...,...,...,...,...,...
882,0,2,Rev. Juozas Montvila,male,27.0,0,0,13.0000
883,1,1,Miss. Margaret Edith Graham,female,19.0,0,0,30.0000
884,0,3,Miss. Catherine Helen Johnston,female,7.0,1,2,23.4500
885,1,1,Mr. Karl Howell Behr,male,26.0,0,0,30.0000
886,0,3,Mr. Patrick Dooley,male,32.0,0,0,7.7500

In [80]:
# 2. Copiar para um novo dataFrame somente as colunas Survived, Pclass, Age e Fare do dataset;
titanic2 = titanic[['Survived', 'Pclass', 'Age', 'Fare']].copy()
titanic2

     Survived  Pclass   Age     Fare
0           0       3  22.0   7.2500
1           1       1  38.0  71.2833
2           1       3  26.0   7.9250
3           1       1  35.0  53.1000
4           0       3  35.0   8.0500
..        ...     ...   ...      ...
882         0       2  27.0  13.0000
883         1       1  19.0  30.0000
884         0       3   7.0  23.4500
885         1       1  26.0  30.0000
886         0       3  32.0   7.7500

[887 rows x 4 columns]

In [81]:
# 3. Criar uma função lambda para alterar a formatação da coluna Survived para ter duas casas decimais;
format = lambda x: '%.2f' % x # %x (aplica no x)
titanic2['Survived'] = titanic2['Survived'].apply(format)
titanic2

    Survived  Pclass   Age     Fare
0       0.00       3  22.0   7.2500
1       1.00       1  38.0  71.2833
2       1.00       3  26.0   7.9250
3       1.00       1  35.0  53.1000
4       0.00       3  35.0   8.0500
..       ...     ...   ...      ...
882     0.00       2  27.0  13.0000
883     1.00       1  19.0  30.0000
884     0.00       3   7.0  23.4500
885     1.00       1  26.0  30.0000
886     0.00       3  32.0   7.7500

[887 rows x 4 columns]

In [82]:
#  4. Criar uma função lambda para alterar a formatação da coluna Pclass para ter três casas decimais;
format = lambda x: '%.3f' % x # %x (aplica no x)
titanic2['Pclass'] = titanic2['Pclass'].apply(format)
titanic2

    Survived Pclass   Age     Fare
0       0.00  3.000  22.0   7.2500
1       1.00  1.000  38.0  71.2833
2       1.00  3.000  26.0   7.9250
3       1.00  1.000  35.0  53.1000
4       0.00  3.000  35.0   8.0500
..       ...    ...   ...      ...
882     0.00  2.000  27.0  13.0000
883     1.00  1.000  19.0  30.0000
884     0.00  3.000   7.0  23.4500
885     1.00  1.000  26.0  30.0000
886     0.00  3.000  32.0   7.7500

[887 rows x 4 columns]

In [83]:
#  5. Criar uma função lambda para alterar a formatação de todo o dataframe para usar somente uma casa
titanic2 = titanic2.astype(float)

format = lambda x: '%.1f' % x # %x (aplica no x)
titanic2 = titanic2.applymap(format)
titanic2

C:\Users\47131502023.1\AppData\Local\Temp\ipykernel_14164\1003725798.py:5: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  titanic2 = titanic2.applymap(format)

    Survived Pclass   Age  Fare
0        0.0    3.0  22.0   7.2
1        1.0    1.0  38.0  71.3
2        1.0    3.0  26.0   7.9
3        1.0    1.0  35.0  53.1
4        0.0    3.0  35.0   8.1
..       ...    ...   ...   ...
882      0.0    2.0  27.0  13.0
883      1.0    1.0  19.0  30.0
884      0.0    3.0   7.0  23.4
885      1.0    1.0  26.0  30.0
886      0.0    3.0  32.0   7.8

[887 rows x 4 columns]

In [84]:
# 6. Criar um dataframe com somente as 5 primeiras linhas do dataframe original;
titanic3 = titanic2.head(5)
titanic3

  Survived Pclass   Age  Fare
0      0.0    3.0  22.0   7.2
1      1.0    1.0  38.0  71.3
2      1.0    3.0  26.0   7.9
3      1.0    1.0  35.0  53.1
4      0.0    3.0  35.0   8.1

## Mini Atividade: Média x Mediana x Moda


#### ➔ O QUE FAZER?
Realizar os cálculos e responder às perguntas: .

    ● Quais são os resultados para os cálculos de média, mediana e moda para os valores seguintes
    conjuntos de valores?
    ● Conjunto 1: N = {3, 5, 4, 7, 9, 5, 2}
    ● Conjunto 2: N = {1, 2, 3, 4, 4, 5, 1000}

In [85]:
n = pd.Series([3, 5, 4, 7, 9, 5, 2])
n2 = pd.Series([1, 2, 3, 4, 4, 5, 1000])

print(n.mean())
print(n.median())
print(n.mode())
print('-------')
print(n2.mean())
print(n2.median())
print(n2.mode())

5.0
5.0
0    5
dtype: int64
-------
145.57142857142858
4.0
0    4
dtype: int64

In [86]:
exemplo_series =  pd.Series([1,5,10,30,30, 40, 500])

#média por formúla
print((1+5+10+30+30+ 40+ 500)/7)
#média por funções soma e quantidade de elementos
print(sum(exemplo_series)/len(exemplo_series))

print('-------')
      
print(exemplo_series.mean())
print(exemplo_series.median())
print(exemplo_series.mode())

88.0
88.0
-------
88.0
30.0
0    30
dtype: int64

In [87]:
print(titanic['Age'].mean())
print(titanic['Age'].mode())

29.471443066516347
0    22.0
Name: Age, dtype: float64

## Atividade: Ticket Titanic

#### ➔ O QUE FAZER?
    1. Desenvolver um código que faça o cálculo das três medidas estatísticas utilizando o mesmo dataset
    titanic
    2. Durante os exemplos da aula foi feita a demonstração da média, moda e mediana através da
    idade dos passageiros, agora vocês deverão fazer utilizando o valor da coluna que informa a tarifa
    paga pelos passageiros (Fare).

In [88]:
print(titanic['Fare'])

print('-------')

print(titanic['Fare'].mean())
print(titanic['Fare'].median())
print(titanic['Fare'].mode())

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
882    13.0000
883    30.0000
884    23.4500
885    30.0000
886     7.7500
Name: Fare, Length: 887, dtype: float64
-------
32.30542018038331
14.4542
0    8.05
Name: Fare, dtype: float64